Revit 2027 API
BuiltInFailures.SlantedColumnFailures Class
 Failures about SlantedColumn.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SlantedColumnFailures
Public NotInheritable Class SlantedColumnFailures
public ref class SlantedColumnFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SlantedColumnFailures = class end
The BuiltInFailures.SlantedColumnFailures type exposes the following members.
Properties
Name | Description
CannotCutParallelToLocationCurve |  Cut plane of slanted column end is parallel to the location curve.
SlantedColumnCannotCutEnd |  Unable to trim slanted column end geometry to desired condition.
SlantedColumnCannotCutEndWarn |  Unable to trim slanted column end geometry to desired condition.
Top
See Also
Reference
Autodesk.Revit.DB Namespace